# 二进制转十进制
print('二进制1111011转十进制',int("1111011", 2))
print('二进制1111011转十进制',eval("0b1111011"))

# 十进制转二进制
print('十进制18转二进制',bin(18))
print('十进制18转二进制',"{0:b}".format(18))

# 八进制转十进制
print('八进制011转十进制',int("011", 8))
print('八进制011转十进制',eval("0o011"))

# 十进制转八进制
print('十进制011转八进制',oct(30))
print('十进制011转八进制',"{0:o}".format(30))

# 十六进制转十进制
print('十六进制12转十进制',int("12", 16))
print('十六进制12转十进制',eval("0x12"))

# 十进制转十六进制
print('十进制87转十六进制',hex(87))
print('十进制87转十六进制',"{0:x}".format(87))
